{
    "code": "0000",
    "data": {
        "medicineTotal": 87,
        "subImage": "",
        "corporeityResult": {
            "recordStatus": 3,
            "resultList": [{
                    "inclination": "易患结核病、色斑、肿瘤、高血压、高脂血症、糖尿病、便秘等病症。",
                    "features": "阴液少，以口燥咽干、手足心热等虚热表现为主要特征，体型偏瘦。",
                    "commonDiseases": "手脚心发热，平时总感觉口燥咽干，鼻头发干，总是感觉口渴爱吃冷饮，舌头发红，口干，唾液少，经常感觉头晕眼花，视物模糊耳鸣，失眠，大便干燥，小便短涩。",
                    "dietaryAdviceSuitable": "保证充足的睡眠时间，以藏养阴气，特别是秋冬季，更要注意保护阴精，多吃滋补机体阴气的食物。如：芝麻、绿豆、鸭肉、猪肉、猪皮、兔肉、牛奶、豆腐、乌贼、龟、鳖、螃蟹、牡砺、蛤俐、海哲、海参、苦瓜、甘蔗、木耳、银耳等。",
                    "conditioning": "阴虚质者多生内热，治以滋润脏腑，消除内热，故总体采用滋补肾阴之法。",
                    "typeName": "阴虚质",
                    "dietaryAdviceAvoid": "不宜吃温燥、辛辣、香浓的食物，同时阴虚质亚健康者应忌吃煎炸炒爆食品和脂肪含量过高食物。",
                    "dietaryAdvice": "阴虚质平时多吃滋补肾阴食物",
                    "directionName": "基本是",
                    "directionCode": "basic",
                    "typeCode": "b_yin_asthenia"
                },
                {
                    "inclination": "过敏体质者易患哮喘、荨麻疹等；遗传性疾病如血友病等；胎传性疾病如五迟、五软等。",
                    "features": "先天失常，以生理缺陷、过敏反应等为主要特征。",
                    "commonDiseases": "过敏体质者常见哮喘、风团、咽痒、鼻塞、喷嚏等；患遗传性疾病者有垂直遗传、先天性、家族性特征；患胎传性疾病者具有母体影响胎儿个体生长发育及相关疾病特征。",
                    "dietaryAdviceSuitable": "清淡、均衡，粗细搭配适当，荤素配伍合理。",
                    "conditioning": "临床对于先天性、遗传性疾病，或生理缺陷，一般无特殊调治方法。或从亲代调治，防止疾病遗传。过敏质者或益气固表，或凉血消风，总以纠正过敏体质为法。",
                    "typeName": "特禀质",
                    "dietaryAdviceAvoid": "蚕豆，白扁豆，牛肉，鹅肉，蟹，鲤鱼，茄子，酒， 辣椒， 浓茶， 咖啡等辛辣之品， 腥膻发物及含致敏物质的食物。",
                    "dietaryAdvice": "特禀质饮食宜清淡，均衡，粗细搭配适当，荤素配伍合理",
                    "directionName": "倾向是",
                    "directionCode": "tendency",
                    "typeCode": "h_allergic"
                }
            ],
            "recordNo": "20211012897509303006781440"
        },
        "suggest": {
            "foodWorse": "禁食温燥的水果、调味品等，如荔枝、龙眼、榴莲、芒果、八角、花椒、肉桂、狗肉、羊肉、雀肉、海马、海龙、獐肉、锅巴、炒花生、炒黄豆、炒瓜子、爆米花、佛手柑、杨梅、大蒜、韭菜、芥菜、辣椒、薤白、胡椒、砂仁、荜茇、草豆蔻、花椒、肉桂、白豆蔻、大茴香、小茴香、丁香、酒、烟、红参、肉苁蓉、锁阳等等，也不要吃辛辣刺激、高脂肪、高热量等油腻的食品。",
            "foodBetter": "凡阴虚体质者，宜多吃些清补类食物，宜食甘凉滋润、生津养阴的食品，宜吃新鲜蔬菜水果或纤维素及维生素较高的食物，宜吃含优质蛋白质丰富的食品，如糯米、绿豆、藕、马兰头、大白菜、黑木耳、银耳、豆腐、甘蔗、梨、西瓜、黄瓜、百合、山药、乌贼等。这些食品性味多甘寒性凉，都有滋补机体阴气的功效。可适当配合补阴药膳有针对性地调养。",
            "medicine": "阴虚火旺主要特征为五心烦热、颧红、失眠盗汗、口燥咽干、眩晕、耳鸣、舌红少苔、脉细数等。中成药可用六味地黄丸。具体用药需要在专业医师的指导下服用。",
            "food": "阴虚火旺属于一种慢性症状，这个跟身体的体质和各项器官的状况都有关系。在食物的选择上，可以选择一些滋阴补肾和清热降火的食物，例如蜂蜜、百合、枸杞、山药、大枣等，对于气血有着滋补的作用，同时又不会增加体内的火气。还可以选择一些有滋阴降火功能的药膳和汤品来尝试，例如生地黄汤汁来煮粥、百合山药莲藕汤、蜂蜜水、或者大枣粥、天门冬粥等，这些都是一些可以滋阴的汤品，尽可以尝试一下。"
        },
        "program": {
            "specificProgram": [{
                "moxibustionOrder": "1",
                "acupointHealth": [{
                        "acupointPic": "https://xunai-base.oss-cn-shenzhen.aliyuncs.com/baseData/acupoint/zh_CN/img_long/acu_54_long.png",
                        "moxibustionDuration": "灸15分钟",
                        "acupointName": "太溪穴 (双穴)"
                    },
                    {
                        "acupointPic": "https://xunai-base.oss-cn-shenzhen.aliyuncs.com/baseData/acupoint/zh_CN/img_long/acu_246_long.png",
                        "moxibustionDuration": "灸15分钟",
                        "acupointName": "涌泉穴 (双穴)"
                    },
                    {
                        "acupointPic": "https://xunai-base.oss-cn-shenzhen.aliyuncs.com/baseData/acupoint/zh_CN/img_long/acu_138_long.png",
                        "moxibustionDuration": "灸15分钟",
                        "acupointName": "三阴交穴 (双穴)"
                    }
                ]
            }],
            "symptomsIntroduction": "阴虚火旺是指体内阴液不足，虚火旺盛，以心烦失眠、口燥咽干、睡着时出汗、遗精、性欲亢进、两颧潮红、小便短黄、大便干结，或咳血、衄血，或舌体、口腔溃疡，舌红少津，脉细数等常见证候。多见形体消瘦，能吃却不会胖，而且多喜饮食冷食，及“五心烦热”，即手心、脚心、胸中发热，但体温正常。",
            "clinicalExperience": "可搭配中药调理，效果更佳。若偏于心火亢盛，而见口舌生疮者，可加莲子心、竹叶、灯芯草；若偏于阴虚甚者，可加生地、麦冬、女贞子；若兼气虚者，可加黄芪、太子参、或西洋参；若小便短赤不畅者，可加白茅根、车前草；兼胃阴虚者，加石斛、玉竹、荸荠汁；若失眠者，可加远志、合欢花。",
            "remarks": "注：(1)阴虚火旺者，灸量宜小，每穴不宜超过15min。",
            "diseaseTags": "阴虚体质"
        },
        "explanation": "舌深红主热证，苔薄白主表证，本舌象属于体质向来阴虚火旺，又突然外感风寒，绛舌必然出现在表证之前，先有里热再有表寒；或为表邪未解，热入营血，绛舌必然是逐渐形成的，先有表寒再有里热。",
        "subDiagProjectDetail": "",
        "tongueFurColour": {
            "explain": "舌面上的舌苔呈现白色，是最常见的苔色。可为正常舌苔，疾病情况下主表证、寒证、湿证，也可见于热证。",
            "type": "白苔"
        },
        "result": "1.素体阴虚火旺，复感风寒；2.表邪未解，热入营血。",
        "tongueColour": {
            "explain": "较红舌更深或略带暗红色。主里热亢盛、阴虚火旺。",
            "type": "绛舌"
        },
        "tongueImage": "http://www.images.jpg",
        "tongueShape": [{
                "explain": "点是指鼓起于舌面的红色、白色、或黑色星点；刺是指芒刺，即舌面上的软刺及颗粒增大，形成尖峰，高起如刺，摸之棘手；舌边，映射肝胆变化，该部位点刺的病理基础为肝胆火旺，或肝胆湿热，热邪上循舌面，蒸灼血脉，形成高于舌面的星点。",
                "type": "舌边点刺"
            },
            {
                "explain": "点是指鼓起于舌面的红色、白色、或黑色星点；刺是指芒刺，即舌面上的软刺及颗粒增大，形成尖峰，高起如刺，摸之棘手；舌尖，映射心脏变化，该部位点刺的病理基础为心火旺盛，热邪上循舌面，蒸灼血脉，形成高于舌面的星点。",
                "type": "舌尖点刺"
            },
            {
                "explain": "舌体瘦小而薄。主气血不足、阴虚火旺",
                "type": "瘦薄舌"
            }
        ],
        "tongueFurQuality": [{
            "explain": "厚苔：不能透过舌苔见到舌体。腻苔：苔质颗粒细腻致密，紧贴舌面，不容易刮掉。厚腻苔是由胃气挟湿浊、痰湿、食滞等邪气熏蒸所致；当痰湿浊邪化热时，还可在苔色上反映出来，如苔黄厚腻，为湿热、痰热、暑温等邪内蕴。",
            "type": "厚腻苔"
        }],
        "subDiagProject": "",
        "notifyCode": "607808677180739584"
    },
    "msg": "成功"
}